Documents/ДоговорМикрозайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ДоговорМикрозайма</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоДоговорам</xr:Item>
				<xr:Item>InformationRegister.ПериодыПросрочки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыРасчетаЗайма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыданногоЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроцентнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиПросроченныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиШтрафы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПроцентнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСрокаЗайма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьСрокаЗайма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодичностей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогашения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПогашенияЗаймов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьОстаткиНаДатуЦессии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АЭ_ВидыСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнтервалыПроцентнойСтавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнтервалОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РасчетныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>РасчетныеДанные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.РасчетныеХарактеристики</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РасчетныеХарактеристики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПериодыПросрочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПериодыПросрочки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МетодРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыРасчетаДнейПросрочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПросрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДвиженийПоРасчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыДвиженийПоРасчетам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реструктуризация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Актуализация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/МетодыРасчетаДнейПросрочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>МетодыРасчетаДнейПросрочки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FIFO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LIFO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДоговорМикрозайма/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДоговорМикрозайма.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ДоговорМикрозайма КАК ДоговорМикрозайма
	                      |ГДЕ
	                      |	ДоговорМикрозайма.Займ = &Займ
	                      |	И ДоговорМикрозайма.Ссылка <> &Ссылка
	                      |	И ДоговорМикрозайма.Проведен = ИСТИНА");
	Запрос.УстановитьПараметр("Займ", ЭтотОбъект.Займ);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Отказ = Истина;
		Сообщить("По данному займу уже есть первичный договор!");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения <> Неопределено Тогда
		Займ = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	НаборЗаписей = РегистрыСведений.РасчетныеДанные.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Займ.Установить(ЭтотОбъект.Займ);
	НаборЗаписей.Записать();
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.ГрафикПлатежей.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ДатаПоследнегоДопСоглашения = РасчетЗадолженностиМФО.ДатаПоследнегоДопСоглашения(ЭтотОбъект.Займ);
	Если ДатаПоследнегоДопСоглашения > ЭтотОбъект.ДатаДоговора Тогда
		Отказ = Истина;
		Сообщить("Существует действующее доп.соглашение с более поздней датой. Проведение невозможно");
		Возврат;
	КонецЕсли;
	ДатаРасчета = РасчетЗадолженностиМФО.ПолучитьДатуРасчетаСУчетомГоризонта(НачалоДня(ТекущаяДата()));
	ДатаДопСоглашения = РасчетЗадолженностиМФО.ПолучитьДатуДопСоглашения(ЭтотОбъект.Ссылка);
	Если ДатаДопСоглашения = Неопределено Тогда
		РасчетнаяДата = Макс(ДатаРасчета, ЭтотОбъект.ДатаПогашения);
	Иначе
		РасчетнаяДата = ДатаДопСоглашения;
	КонецЕсли;
	
	
	Остатки = РасчетЗадолженностиМФО.ПолучитьОстаткиПоДоговору(ЭтотОбъект.Ссылка, НачалоДня(ТекущаяДата()));
	ТаблицаПлатежей = РасчетЗадолженностиМФО.ПолучитьИсториюПлатежей(ЭтотОбъект);
	РассчитанныйГрафик = РасчетЗадолженностиМФО.РасчитатьГрафикПлатежейИНачисленийНачальныеОстатки(ЭтотОбъект, РасчетнаяДата, ТаблицаПлатежей, Остатки);
	
	//  1. Очистка старых движений регистра
    Движения.ПериодыПросрочки.Очистить();
    Движения.ПериодыПросрочки.Записывать = Истина;
    Движения.РасчетыПоДоговорам.Очистить();
    Движения.РасчетыПоДоговорам.Записывать = Истина;
    Движения.Записать();
	
	Движения.РасчетыПоДоговорам.Записывать = Истина;
	// регистр ПериодыПросрочки
	Движения.ПериодыПросрочки.Записывать = Истина;
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(ДоговорМикрозаймаГрафикПлатежей.ОплатаОсновнойДолг) КАК ОплатаОсновнойДолг,
	                      |	СУММА(ДоговорМикрозаймаГрафикПлатежей.ОплатаПроценты) КАК ОплатаПроценты
	                      |ИЗ
	                      |	Документ.ДоговорМикрозайма.ГрафикПлатежей КАК ДоговорМикрозаймаГрафикПлатежей
	                      |ГДЕ
	                      |	ДоговорМикрозаймаГрафикПлатежей.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() И Не ЭтотОбъект.УчитыватьОстаткиНаДатуЦессии Тогда
		Движение = Движения.РасчетыПоДоговорам.Добавить();
		Движение.Займ = ЭтотОбъект.Займ;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВидДвиженияЗадолженности = Перечисления.ВидыДвиженийПоРасчетам.Начисление;
		Движение.ОсновнойДолг = Результат.ОплатаОсновнойДолг;
		Движение.Проценты = Результат.ОплатаПроценты;
		Движение.Период = ЭтотОбъект.ДатаВыдачиЗайма;
	КонецЕсли;
	
	ДатаВыхода = Неопределено;
	ДниПросрочкиФИФО = 0;
	ДатаВыходаФИФО = Неопределено;
	СуммаНаСчете = 0;

	Если ЭтотОбъект.УчитыватьОстаткиНаДатуЦессии Тогда
		Движение = Движения.РасчетыПоДоговорам.Добавить();
		Движение.Займ = ЭтотОбъект.Займ;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВидДвиженияЗадолженности = Перечисления.ВидыДвиженийПоРасчетам.Начисление;
		Движение.ОсновнойДолгГрафик = ЭтотОбъект.ОстаткиОсновнойДолг;
		Движение.ПроцентыГрафик = ЭтотОбъект.ОстаткиПроценты + ЭтотОбъект.ОстаткиПросроченныеПроценты;
		Движение.ПроцентыНачисленныеВПериодПросрочки = ЭтотОбъект.ОстаткиПросроченныеПроценты;
		Движение.Штрафы = ЭтотОбъект.ОстаткиШтрафы;
		Движение.Пени = ЭтотОбъект.ОстаткиПени;
		Движение.ПроцентыНачисления = Движение.ПроцентыГрафик;
		Движение.ШтрафыНачисления = Движение.Штрафы;
		Движение.ПениНачисления = Движение.Пени;
		Движение.Период = ЭтотОбъект.ОстаткиДата;			
	КонецЕсли;
	
	Для Каждого стр из РассчитанныйГрафик Цикл
		
		Если стр.ПлановыйГрафик_ОплатаОсновнойДолг <> 0 ИЛИ стр.Проценты <> 0 ИЛИ стр.ПросроченныеПроценты <> 0 ИЛИ стр.Штрафы <> 0 ИЛИ стр.Пени <> 0 Тогда
			Движение = Движения.РасчетыПоДоговорам.Добавить();
			Движение.Займ = ЭтотОбъект.Займ;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.ВидДвиженияЗадолженности = Перечисления.ВидыДвиженийПоРасчетам.Начисление;
			Движение.ОсновнойДолгГрафик = стр.ПлановыйГрафик_ОплатаОсновнойДолг;
			Движение.ПроцентыГрафик = стр.Проценты + стр.ПросроченныеПроценты;
			Движение.ПроцентыНачисленныеВПериодПросрочки = стр.ПросроченныеПроценты;
			Движение.Штрафы = стр.Штрафы;
			Движение.Пени = стр.Пени;
			Движение.ПроцентыНачисления = Движение.ПроцентыГрафик;
			Движение.ШтрафыНачисления = Движение.Штрафы;
			Движение.ПениНачисления = Движение.Пени;
			Движение.Период = стр.Дата;	
		КонецЕсли;
		
		Если стр.КорректировкаПроценты > 0 Тогда
			Движение = Движения.РасчетыПоДоговорам.Добавить();
			Движение.Займ = ЭтотОбъект.Займ;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.ВидДвиженияЗадолженности = Перечисления.ВидыДвиженийПоРасчетам.Корректировка;
			Движение.Проценты = стр.КорректировкаПроценты;			
			Движение.Период = стр.Дата;				
		КонецЕсли;
		
		Если стр.ОплатаОсновнойДолг <> 0 ИЛИ стр.ОплатаПроценты <> 0 ИЛИ стр.ОплатаПросроченныеПроценты <> 0 ИЛИ стр.ОплатаШтрафы <> 0 ИЛИ стр.ОплатаПени <> 0 Тогда
			Движение = Движения.РасчетыПоДоговорам.Добавить();
			Движение.Займ = ЭтотОбъект.Займ;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.ВидДвиженияЗадолженности = Перечисления.ВидыДвиженийПоРасчетам.Оплата;
			Движение.ОсновнойДолг = стр.ОплатаОсновнойДолг;
			Движение.ОсновнойДолгГрафик = стр.ОплатаОсновнойДолг;
			Движение.Проценты = стр.ОплатаПроценты + стр.ОплатаПросроченныеПроценты;
			Движение.ПроцентыГрафик = стр.ОплатаПроценты + стр.ОплатаПросроченныеПроценты;
			Движение.ПроцентыНачисленныеВПериодПросрочки = стр.ОплатаПросроченныеПроценты;		
			Движение.Штрафы = стр.ОплатаШтрафы;
			Движение.Пени = стр.ОплатаПени;
			Движение.Период = стр.Дата;
			
		КонецЕсли;				
		Если стр.Переплата <> СуммаНаСчете Тогда
			Движение = Движения.РасчетыПоДоговорам.Добавить();
			Движение.Займ = ЭтотОбъект.Займ;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.ВидДвиженияЗадолженности = Перечисления.ВидыДвиженийПоРасчетам.РасчетныйСчет;
			Движение.РасчетныйСчет = стр.Переплата - СуммаНаСчете;
			Движение.Период = стр.Дата;				
		КонецЕсли;

		
		Если стр.ДниПросрочки = 1 Тогда
			ДвижениеПериод = Движения.ПериодыПросрочки.Добавить();
			ДвижениеПериод.ДатаПросрочки = стр.Дата - 24*3600;
			ДвижениеПериод.Период = ЭтотОбъект.ДатаДоговора;
			ДвижениеПериод.МетодРасчета = Перечисления.МетодыРасчетаДнейПросрочки.LIFO;
			ДвижениеПериод.Займ = ЭтотОбъект.Займ;
			
			ДатаВыхода = стр.Дата;
		ИначеЕсли стр.ДниПросрочки = 0 И ДатаВыхода <> Неопределено Тогда
			ДвижениеПериод.ДатаПогашения = стр.Дата - 24*3600;
			ДатаВыхода = Неопределено;
		КонецЕсли;
		
		Если стр.ДниПросрочки_ФИФО < ДниПросрочкиФИФО Тогда
			ДвижениеПериодФИФО = Движения.ПериодыПросрочки.Добавить();
			ДвижениеПериодФИФО.МетодРасчета = Перечисления.МетодыРасчетаДнейПросрочки.FIFO;
			ДвижениеПериодФИФО.ДатаПросрочки = стр.Дата - (ДниПросрочкиФИФО+1)*24*3600;
			ДвижениеПериодФИФО.Период = ЭтотОбъект.ДатаДоговора;
			ДвижениеПериодФИФО.ДатаПогашения = стр.Дата - 24*3600;
			ДвижениеПериодФИФО.Займ = ЭтотОбъект.Займ;
		КонецЕсли;
			
		ДниПросрочкиФИФО = стр.ДниПросрочки_ФИФО;
		СуммаНаСчете = стр.Переплата;
	КонецЦикла;
	
	Если стр.ДниПросрочки_ФИФО > 0 Тогда
		ДвижениеПериодФИФО = Движения.ПериодыПросрочки.Добавить();
		ДвижениеПериодФИФО.МетодРасчета = Перечисления.МетодыРасчетаДнейПросрочки.FIFO;
		ДвижениеПериодФИФО.ДатаПросрочки = стр.Дата - (ДниПросрочкиФИФО)*24*3600;
		ДвижениеПериодФИФО.Период = ЭтотОбъект.ДатаДоговора;
		ДвижениеПериодФИФО.Займ = ЭтотОбъект.Займ;		
	КонецЕсли;	
КонецПроцедуры
